/* Back */
"Back" = "Back";

/* No comment provided by engineer. */
"Cannot connect to Internet" = "Cannot connect to Internet.";

/* No comment provided by engineer. */
"Cannot reach the Internet. Please be sure that your device is connected to the Internet and try again." = "Impossible to connect to the Internet. Please make sure  your device is connected and try again.";

/* No comment provided by engineer. */
"ERROR" = "Error";

/* No comment provided by engineer. */
"Error" = "Error";

/* No comment provided by engineer. */
"error while uploading the image, something whent wrong" = "Error while processing the request. Please try again in a few seconds.";

/* No comment provided by engineer. */
"loading web view,  please wait ... " = "Loading website, please wait...";

/* No comment provided by engineer. */
"NO MATCH" = "No match found";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Retry" = "Retry";

/* No comment provided by engineer. */
"Something went wrong while trying to load the web page, please try it again later" = "Error while loading website, please try again later.";

/* No comment provided by engineer. */
"there has been an error while uploading the picture to the server, please try it again later." = "Error while processing the request. Please try again in a few seconds.";

/* No comment provided by engineer. */
"there is no object in the collection that matches with any in the picture" = "There is no object in the collection that matches your request.";

/* No comment provided by engineer. */
"there's been an error while trying to connect to the server" = "Error while connecting to the server. Please try again in a few seconds.";

/* No comment provided by engineer. */
"Token Invalid" = "Invalid Token";

/* No comment provided by engineer. */
"Uploading the image to the server, this may take a while..." = "Processing your request...";

